import random

PUNCTUATION_MAP = {
    '.': [' نقطه '],
    ':': [' دو نقطه '],
    '،': [' ویرگول ', ' کاما '],
    '_': [' آندرلاین ', ' زیرخط '],
    '-': [' خط تیره ', ' خط فاصله '],
    '/': [' ممیز '],
    '٪': [' درصد '],
    '%': [' درصد '],
    '؛': [' نقطه ویرگول '],
    '؟': [' علامت سؤال '],
    '?': [' علامت سؤال '],
    '!': [' علامت تعجب '],
    '(': [' پرانتز باز '],
    ')': [' پرانتز بسته '],
    '[': [' کروشه باز ', ' آکولاد باز ', ' قلاب باز '],
    ']': [' کروشه بسته ', ' آکولاد بسته ', ' قلاب بسته '],
    '«': [' گیومه باز '],
    '»': [' گیومه بسته '],
    '…': [' سه نقطه '],
    '@': [' علامت اتساین '],
    '#': [' علامت شارپ ', ' علامت هشتگ '],
    '&': [' و '],
    '*': [' علامت ستاره '],
    '+': [' جمع '],
    '=': [' مساوی '],
    '|': [' یا '],
    '<': [' بزرگتر '],
    '>': [' کوچکتر '],
    '\'': [' کوتیشن '],
    '"': [' دابل کوتیشن ']
}

NEW_LINES = ['سر خط', 'خط جدید', 'سر سطر', 'پاراگراف جدید']


def punctuation_map(
        char: str,
        random_result: bool = False
) -> str:
    if char == '\n':
        if not random_result:
            return NEW_LINES[0]
        else:
            rand = random.randint(0, 3)
            return NEW_LINES[rand]
    else:
        if not random_result:
            try:
                return PUNCTUATION_MAP[char][0]
            except KeyError:
                return char
        else:
            pass
