import random

STT_PUNCTUATION_MAP = {
    '.': [' نقطه '],
    ':': [' دو نقطه '],
    '،': [' ویرگول ', ' کاما '],
    '_': [' آندرلاین ', ' زیرخط '],
    '-': [' خط تیره ', ' خط فاصله '],
    '/': [' ممیز '],
    '٪': [' درصد '],
    '%': [' درصد '],
    '؛': [' نقطه ویرگول '],
    '؟': [' علامت سؤال '],
    '?': [' علامت سؤال '],
    '!': [' علامت تعجب '],
    '(': [' پرانتز باز '],
    ')': [' پرانتز بسته '],
    '[': [' کروشه باز ', ' آکولاد باز ', ' قلاب باز '],
    ']': [' کروشه بسته ', ' آکولاد بسته ', ' قلاب بسته '],
    '«': [' گیومه باز '],
    '»': [' گیومه بسته '],
    '…': [' سه نقطه '],
    '@': [' علامت اتساین '],
    '#': [' علامت شارپ ', ' علامت هشتگ '],
    '&': [' و '],
    '*': [' علامت ستاره '],
    '+': [' جمع '],
    '=': [' مساوی '],
    '|': [' یا '],
    '<': [' بزرگتر '],
    '>': [' کوچکتر '],
    '\'': [' کوتیشن '],
    '"': [' دابل کوتیشن '],
    '~': [' '],
    '`': [' '],
    '$': [' '],
    '^': [' '],
    '\\': [' '],
    ',': [' و '],
    '÷': [' تقسیم '],
    '×': [' ضرب ']
}

TSS_PUNCTUATION_MAP = {
    '.': [' . ', ' <SIL> '],
    ':': [' : ', ' <SIL> '],
    '،': [' ، ', ' <SIL> '],
    '_': [' '],
    '-': [' '],
    '/': [' '],
    '٪': [' '],
    '%': [' '],
    '؛': [' ؛ ', ' <SIL> '],
    '؟': [' ؟ ', ' '],
    '?': [' ? ', ' '],
    '!': [' ! ', ' '],
    '(': [' ( ', ' '],
    ')': [' ) ', ' '],
    '[': [' [ ', ' '],
    ']': [' ] ', ' '],
    '«': [' « ', ' '],
    '»': [' » ', ' '],
    '…': [' … ', ' <SIL> '],
    '@': [' @ ', ' '],
    '#': [' '],
    '&': [' '],
    '*': [' * ', ' '],
    '+': [' + ', ' '],
    '=': [' = ', ' '],
    '÷': [' ÷ ', ' '],
    '×': [' × ', ' '],
    '|': [' '],
    '<': [' < ', ' '],
    '>': [' > ', ' '],
    '\'': [' \' ', ' '],
    '"': [' " ', ' '],
    '~': [' '],
    '`': [' '],
    '$': [' '],
    '^': [' '],
    '\\': [' '],
    ',': [' و '],
}

NEW_LINES = ['سر خط', 'خط جدید', 'سر سطر', 'پاراگراف جدید']


def words(
        char: str,
        mode: str = 'TTSv1'
) -> str:
    try:
        if mode == 'TTSv2':
            return TSS_PUNCTUATION_MAP[char][0]
        elif mode == 'TTSv1':
            return TSS_PUNCTUATION_MAP[char][-1]
        elif mode == 'STT':
            res = STT_PUNCTUATION_MAP[char]
            return res[random.randint(0, len(res) - 1)]
    except KeyError:
        pass
    return char
